mboehmerm/Three-IPS-Displays-with-ST7789-170x320-240x280-240x320/ESP32_H2/Arduino/ESP32_H2_TFT_graphicstest_240x280/ESP32_H2_TFT_graphicstest_240x280.ino
	tft.fillScreen(TFT_BLACK);
	n = min(cx, cy);

	start = micros_start();

	for (i = 0; i < n; i += 5)
	{
		tft.drawTriangle(
			cx		, cy - i, // peak
			cx - i, cy + i, // bottom left
			cx + i, cy + i, // bottom right
			tft.color565(0, 0, i));
	}

	return micros() - start;
}

uint32_t testFilledTriangles()
{
	uint32_t start, t = 0;
	int32_t i;
	int32_t cx = tft.width() / 2 - 1;
	int32_t cy = tft.height() / 2 - 1;

	tft.fillScreen(TFT_BLACK);

	start = micros_start();

	for (i = min(cx,cy); i > 10; i -= 5) {
		start = micros_start();
		tft.fillTriangle(cx, cy - i, cx - i, cy + i, cx + i, cy + i,
			tft.color565(0, i, i));
		t += micros() - start;
		tft.drawTriangle(cx, cy - i, cx - i, cy + i, cx + i, cy + i,
			tft.color565(i, i, 0));
	}

	return t;
}

uint32_t testRoundRects()
 {
	uint32_t start;
	int32_t w, i, i2;
	int32_t cx = tft.width() / 2 - 1;
	int32_t cy = tft.height() / 2 - 1;

	tft.fillScreen(TFT_BLACK);
	
	w = min(tft.width(), tft.height());
	
	start = micros_start();

	for (i = 0; i < w; i += 6)
	{
		i2 = i / 2;
		tft.drawRoundRect(cx-i2, cy-i2, i, i, i/8, tft.color565(i, 0, 0));
	}

	return micros() - start;
}

uint32_t testFilledRoundRects()
{
	uint32_t start;
	int32_t i, i2;
	int32_t cx = tft.width() / 2 - 1;
	int32_t cy = tft.height() / 2 - 1;

	tft.fillScreen(TFT_BLACK);

	start = micros_start();

	for (i = min(tft.width(), tft.height()); i > 20; i -= 6)
	{
		i2 = i / 2;
		tft.fillRoundRect(cx-i2, cy-i2, i, i, i/8, tft.color565(0, i, 0));
	}

	return micros() - start;
}

/* 

Processor : ESP32-H2
ESP32     : 3.0.4
TFT_eSPI  : 2.5.43
SPI Write : 80 MHz
no #define USE_xSPI_PORT
MOSI 25 - MISO 11 - SCLK 10 - CS  0 - DC  1 - RST 3
Benchmark                Time (microseconds)
HaD pushColor            204321
Screen fill              36495
Text                     41802
Pixels                   715715
Lines                    769155
Horiz/Vert Lines         18159
Rectangles (outline)     13666
Rectangles (filled)      433670
Circles (filled)         93062
Circles (outline)        71658
Triangles (outline)      51181
Triangles (filled)       183343
Rounded rects (outline)  40344
Rounded rects (filled)   451289
Done!


about 1000 error lin

30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:302:5: note: in expansion of macro 'WRITE_PERI_REG'
  302 |     WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 511);
      |     ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.h:61:34: note: in expansion of macro 'SPI_MS_DLEN_REG'
   61 |     #define SPI_MOSI_DLEN_REG(x) SPI_MS_DLEN_REG(x)
      |                                  ^~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:302:20: note: in expansion of macro 'SPI_MOSI_DLEN_REG'
  302 |     WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 511);
      |                    ^~~~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:311:14: note: in expansion of macro 'READ_PERI_REG'
  311 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |              ^~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:311:28: note: in expansion of macro 'SPI_CMD_REG'
  311 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                            ^~~~~~~~~~~
In file included from c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\TFT_eSPI.cpp:22:
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:311:50: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator&'
  311 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                                                  ^
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1757:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1757 | #define SPI_W0_REG (DR_REG_SPI_BASE + 0x98)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:312:7: note: in expansion of macro 'WRITE_PERI_REG'
  312 |       WRITE_PERI_REG(SPI_W0_REG(SPI_PORT),  color[0]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:312:22: note: in expansion of macro 'SPI_W0_REG'
  312 |       WRITE_PERI_REG(SPI_W0_REG(SPI_PORT),  color[0]);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1769:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1769 | #define SPI_W1_REG (DR_REG_SPI_BASE + 0x9c)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:313:7: note: in expansion of macro 'WRITE_PERI_REG'
  313 |       WRITE_PERI_REG(SPI_W1_REG(SPI_PORT),  color[1]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:313:22: note: in expansion of macro 'SPI_W1_REG'
  313 |       WRITE_PERI_REG(SPI_W1_REG(SPI_PORT),  color[1]);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1781:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1781 | #define SPI_W2_REG (DR_REG_SPI_BASE + 0xa0)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:314:7: note: in expansion of macro 'WRITE_PERI_REG'
  314 |       WRITE_PERI_REG(SPI_W2_REG(SPI_PORT),  color[2]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:314:22: note: in expansion of macro 'SPI_W2_REG'
  314 |       WRITE_PERI_REG(SPI_W2_REG(SPI_PORT),  color[2]);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1793:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1793 | #define SPI_W3_REG (DR_REG_SPI_BASE + 0xa4)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:315:7: note: in expansion of macro 'WRITE_PERI_REG'
  315 |       WRITE_PERI_REG(SPI_W3_REG(SPI_PORT),  color[3]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:315:22: note: in expansion of macro 'SPI_W3_REG'
  315 |       WRITE_PERI_REG(SPI_W3_REG(SPI_PORT),  color[3]);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1805:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1805 | #define SPI_W4_REG (DR_REG_SPI_BASE + 0xa8)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:316:7: note: in expansion of macro 'WRITE_PERI_REG'
  316 |       WRITE_PERI_REG(SPI_W4_REG(SPI_PORT),  color[4]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:316:22: note: in expansion of macro 'SPI_W4_REG'
  316 |       WRITE_PERI_REG(SPI_W4_REG(SPI_PORT),  color[4]);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1817:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1817 | #define SPI_W5_REG (DR_REG_SPI_BASE + 0xac)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:317:7: note: in expansion of macro 'WRITE_PERI_REG'
  317 |       WRITE_PERI_REG(SPI_W5_REG(SPI_PORT),  color[5]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:317:22: note: in expansion of macro 'SPI_W5_REG'
  317 |       WRITE_PERI_REG(SPI_W5_REG(SPI_PORT),  color[5]);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1829:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1829 | #define SPI_W6_REG (DR_REG_SPI_BASE + 0xb0)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:318:7: note: in expansion of macro 'WRITE_PERI_REG'
  318 |       WRITE_PERI_REG(SPI_W6_REG(SPI_PORT),  color[6]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:318:22: note: in expansion of macro 'SPI_W6_REG'
  318 |       WRITE_PERI_REG(SPI_W6_REG(SPI_PORT),  color[6]);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1841:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1841 | #define SPI_W7_REG (DR_REG_SPI_BASE + 0xb4)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:319:7: note: in expansion of macro 'WRITE_PERI_REG'
  319 |       WRITE_PERI_REG(SPI_W7_REG(SPI_PORT),  color[7]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:319:22: note: in expansion of macro 'SPI_W7_REG'
  319 |       WRITE_PERI_REG(SPI_W7_REG(SPI_PORT),  color[7]);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1853:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1853 | #define SPI_W8_REG (DR_REG_SPI_BASE + 0xb8)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:320:7: note: in expansion of macro 'WRITE_PERI_REG'
  320 |       WRITE_PERI_REG(SPI_W8_REG(SPI_PORT),  color[8]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:320:22: note: in expansion of macro 'SPI_W8_REG'
  320 |       WRITE_PERI_REG(SPI_W8_REG(SPI_PORT),  color[8]);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1865:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1865 | #define SPI_W9_REG (DR_REG_SPI_BASE + 0xbc)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:321:7: note: in expansion of macro 'WRITE_PERI_REG'
  321 |       WRITE_PERI_REG(SPI_W9_REG(SPI_PORT),  color[9]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:321:22: note: in expansion of macro 'SPI_W9_REG'
  321 |       WRITE_PERI_REG(SPI_W9_REG(SPI_PORT),  color[9]);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1877:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1877 | #define SPI_W10_REG (DR_REG_SPI_BASE + 0xc0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:322:7: note: in expansion of macro 'WRITE_PERI_REG'
  322 |       WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), color[10]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:322:22: note: in expansion of macro 'SPI_W10_REG'
  322 |       WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), color[10]);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1889:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1889 | #define SPI_W11_REG (DR_REG_SPI_BASE + 0xc4)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:323:7: note: in expansion of macro 'WRITE_PERI_REG'
  323 |       WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), color[11]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:323:22: note: in expansion of macro 'SPI_W11_REG'
  323 |       WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), color[11]);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1901:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1901 | #define SPI_W12_REG (DR_REG_SPI_BASE + 0xc8)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:324:7: note: in expansion of macro 'WRITE_PERI_REG'
  324 |       WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), color[12]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:324:22: note: in expansion of macro 'SPI_W12_REG'
  324 |       WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), color[12]);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1913:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1913 | #define SPI_W13_REG (DR_REG_SPI_BASE + 0xcc)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:325:7: note: in expansion of macro 'WRITE_PERI_REG'
  325 |       WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), color[13]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:325:22: note: in expansion of macro 'SPI_W13_REG'
  325 |       WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), color[13]);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1925:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1925 | #define SPI_W14_REG (DR_REG_SPI_BASE + 0xd0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:326:7: note: in expansion of macro 'WRITE_PERI_REG'
  326 |       WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), color[14]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:326:22: note: in expansion of macro 'SPI_W14_REG'
  326 |       WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), color[14]);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1937:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1937 | #define SPI_W15_REG (DR_REG_SPI_BASE + 0xd4)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:327:7: note: in expansion of macro 'WRITE_PERI_REG'
  327 |       WRITE_PERI_REG(SPI_W15_REG(SPI_PORT), color[15]);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:327:22: note: in expansion of macro 'SPI_W15_REG'
  327 |       WRITE_PERI_REG(SPI_W15_REG(SPI_PORT), color[15]);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:13: note: in expansion of macro 'WRITE_PERI_REG'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |             ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:329:7: note: in expansion of macro 'SET_PERI_REG_MASK'
  329 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |       ^~~~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:329:25: note: in expansion of macro 'SPI_CMD_REG'
  329 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |                         ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:54: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator|'
