mboehmerm/Three-IPS-Displays-with-ST7789-170x320-240x280-240x320/ESP32_H2/Arduino/ESP32_H2_TFT_graphicstest_240x280/ESP32_H2_TFT_graphicstest_240x280.ino
  365 |     while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                          ^~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:365:48: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator&'
  365 |     while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                                                ^
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:481:26: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
  481 | #define SPI_MS_DLEN_REG (DR_REG_SPI_BASE + 0x1c)
      |                          ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:366:5: note: in expansion of macro 'WRITE_PERI_REG'
  366 |     WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), (len << 4) - 1);
      |     ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.h:61:34: note: in expansion of macro 'SPI_MS_DLEN_REG'
   61 |     #define SPI_MOSI_DLEN_REG(x) SPI_MS_DLEN_REG(x)
      |                                  ^~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:366:20: note: in expansion of macro 'SPI_MOSI_DLEN_REG'
  366 |     WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), (len << 4) - 1);
      |                    ^~~~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1757:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1757 | #define SPI_W0_REG (DR_REG_SPI_BASE + 0x98)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:368:7: note: in expansion of macro 'WRITE_PERI_REG'
  368 |       WRITE_PERI_REG(SPI_W0_REG(SPI_PORT)+i, DAT8TO32(data)); data+=4;
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:368:22: note: in expansion of macro 'SPI_W0_REG'
  368 |       WRITE_PERI_REG(SPI_W0_REG(SPI_PORT)+i, DAT8TO32(data)); data+=4;
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:13: note: in expansion of macro 'WRITE_PERI_REG'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |             ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:371:5: note: in expansion of macro 'SET_PERI_REG_MASK'
  371 |     SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |     ^~~~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:371:23: note: in expansion of macro 'SPI_CMD_REG'
  371 |     SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |                       ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:54: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator|'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |                                                      ^~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:100:76: note: in definition of macro 'WRITE_PERI_REG'
  100 |             (*((volatile uint32_t *)ETS_UNCACHED_ADDR(addr))) = (uint32_t)(val);                                       \
      |                                                                            ^~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:371:5: note: in expansion of macro 'SET_PERI_REG_MASK'
  371 |     SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |     ^~~~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:372:12: note: in expansion of macro 'READ_PERI_REG'
  372 |     while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_UPDATE);
      |            ^~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:372:26: note: in expansion of macro 'SPI_CMD_REG'
  372 |     while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_UPDATE);
      |                          ^~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:372:48: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator&'
  372 |     while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_UPDATE);
      |                                                ^
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:13: note: in expansion of macro 'WRITE_PERI_REG'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |             ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:374:5: note: in expansion of macro 'SET_PERI_REG_MASK'
  374 |     SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      |     ^~~~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:374:23: note: in expansion of macro 'SPI_CMD_REG'
  374 |     SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      |                       ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:54: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator|'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |                                                      ^~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:100:76: note: in definition of macro 'WRITE_PERI_REG'
  100 |             (*((volatile uint32_t *)ETS_UNCACHED_ADDR(addr))) = (uint32_t)(val);                                       \
      |                                                                            ^~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:374:5: note: in expansion of macro 'SET_PERI_REG_MASK'
  374 |     SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      |     ^~~~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:376:10: note: in expansion of macro 'READ_PERI_REG'
  376 |   while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |          ^~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:376:24: note: in expansion of macro 'SPI_CMD_REG'
  376 |   while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                        ^~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:376:46: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator&'
  376 |   while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                                              ^
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c: In member function 'void TFT_eSPI::pushPixels(const void*, uint32_t)':
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:481:26: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
  481 | #define SPI_MS_DLEN_REG (DR_REG_SPI_BASE + 0x1c)
      |                          ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:395:5: note: in expansion of macro 'WRITE_PERI_REG'
  395 |     WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 511);
      |     ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.h:61:34: note: in expansion of macro 'SPI_MS_DLEN_REG'
   61 |     #define SPI_MOSI_DLEN_REG(x) SPI_MS_DLEN_REG(x)
      |                                  ^~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:395:20: note: in expansion of macro 'SPI_MOSI_DLEN_REG'
  395 |     WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), 511);
      |                    ^~~~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:398:14: note: in expansion of macro 'READ_PERI_REG'
  398 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |              ^~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:398:28: note: in expansion of macro 'SPI_CMD_REG'
  398 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                            ^~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:398:50: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator&'
  398 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                                                  ^
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1757:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1757 | #define SPI_W0_REG (DR_REG_SPI_BASE + 0x98)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:399:7: note: in expansion of macro 'WRITE_PERI_REG'
  399 |       WRITE_PERI_REG(SPI_W0_REG(SPI_PORT),  *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:399:22: note: in expansion of macro 'SPI_W0_REG'
  399 |       WRITE_PERI_REG(SPI_W0_REG(SPI_PORT),  *data++);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1769:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1769 | #define SPI_W1_REG (DR_REG_SPI_BASE + 0x9c)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:400:7: note: in expansion of macro 'WRITE_PERI_REG'
  400 |       WRITE_PERI_REG(SPI_W1_REG(SPI_PORT),  *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:400:22: note: in expansion of macro 'SPI_W1_REG'
  400 |       WRITE_PERI_REG(SPI_W1_REG(SPI_PORT),  *data++);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1781:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1781 | #define SPI_W2_REG (DR_REG_SPI_BASE + 0xa0)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:401:7: note: in expansion of macro 'WRITE_PERI_REG'
  401 |       WRITE_PERI_REG(SPI_W2_REG(SPI_PORT),  *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:401:22: note: in expansion of macro 'SPI_W2_REG'
  401 |       WRITE_PERI_REG(SPI_W2_REG(SPI_PORT),  *data++);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1793:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1793 | #define SPI_W3_REG (DR_REG_SPI_BASE + 0xa4)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:402:7: note: in expansion of macro 'WRITE_PERI_REG'
  402 |       WRITE_PERI_REG(SPI_W3_REG(SPI_PORT),  *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:402:22: note: in expansion of macro 'SPI_W3_REG'
  402 |       WRITE_PERI_REG(SPI_W3_REG(SPI_PORT),  *data++);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1805:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1805 | #define SPI_W4_REG (DR_REG_SPI_BASE + 0xa8)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:403:7: note: in expansion of macro 'WRITE_PERI_REG'
  403 |       WRITE_PERI_REG(SPI_W4_REG(SPI_PORT),  *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:403:22: note: in expansion of macro 'SPI_W4_REG'
  403 |       WRITE_PERI_REG(SPI_W4_REG(SPI_PORT),  *data++);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1817:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1817 | #define SPI_W5_REG (DR_REG_SPI_BASE + 0xac)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:404:7: note: in expansion of macro 'WRITE_PERI_REG'
  404 |       WRITE_PERI_REG(SPI_W5_REG(SPI_PORT),  *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:404:22: note: in expansion of macro 'SPI_W5_REG'
  404 |       WRITE_PERI_REG(SPI_W5_REG(SPI_PORT),  *data++);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1829:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1829 | #define SPI_W6_REG (DR_REG_SPI_BASE + 0xb0)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:405:7: note: in expansion of macro 'WRITE_PERI_REG'
  405 |       WRITE_PERI_REG(SPI_W6_REG(SPI_PORT),  *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:405:22: note: in expansion of macro 'SPI_W6_REG'
  405 |       WRITE_PERI_REG(SPI_W6_REG(SPI_PORT),  *data++);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1841:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1841 | #define SPI_W7_REG (DR_REG_SPI_BASE + 0xb4)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:406:7: note: in expansion of macro 'WRITE_PERI_REG'
  406 |       WRITE_PERI_REG(SPI_W7_REG(SPI_PORT),  *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:406:22: note: in expansion of macro 'SPI_W7_REG'
  406 |       WRITE_PERI_REG(SPI_W7_REG(SPI_PORT),  *data++);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1853:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1853 | #define SPI_W8_REG (DR_REG_SPI_BASE + 0xb8)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:407:7: note: in expansion of macro 'WRITE_PERI_REG'
  407 |       WRITE_PERI_REG(SPI_W8_REG(SPI_PORT),  *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:407:22: note: in expansion of macro 'SPI_W8_REG'
  407 |       WRITE_PERI_REG(SPI_W8_REG(SPI_PORT),  *data++);
      |                      ^~~~~~~~~~
