mboehmerm/Three-IPS-Displays-with-ST7789-170x320-240x280-240x320/ESP32_H2/Arduino/ESP32_H2_TFT_graphicstest_240x280/ESP32_H2_TFT_graphicstest_240x280.ino
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1865:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1865 | #define SPI_W9_REG (DR_REG_SPI_BASE + 0xbc)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:408:7: note: in expansion of macro 'WRITE_PERI_REG'
  408 |       WRITE_PERI_REG(SPI_W9_REG(SPI_PORT),  *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:408:22: note: in expansion of macro 'SPI_W9_REG'
  408 |       WRITE_PERI_REG(SPI_W9_REG(SPI_PORT),  *data++);
      |                      ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1877:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1877 | #define SPI_W10_REG (DR_REG_SPI_BASE + 0xc0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:409:7: note: in expansion of macro 'WRITE_PERI_REG'
  409 |       WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:409:22: note: in expansion of macro 'SPI_W10_REG'
  409 |       WRITE_PERI_REG(SPI_W10_REG(SPI_PORT), *data++);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1889:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1889 | #define SPI_W11_REG (DR_REG_SPI_BASE + 0xc4)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:410:7: note: in expansion of macro 'WRITE_PERI_REG'
  410 |       WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:410:22: note: in expansion of macro 'SPI_W11_REG'
  410 |       WRITE_PERI_REG(SPI_W11_REG(SPI_PORT), *data++);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1901:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1901 | #define SPI_W12_REG (DR_REG_SPI_BASE + 0xc8)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:411:7: note: in expansion of macro 'WRITE_PERI_REG'
  411 |       WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:411:22: note: in expansion of macro 'SPI_W12_REG'
  411 |       WRITE_PERI_REG(SPI_W12_REG(SPI_PORT), *data++);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1913:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1913 | #define SPI_W13_REG (DR_REG_SPI_BASE + 0xcc)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:412:7: note: in expansion of macro 'WRITE_PERI_REG'
  412 |       WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:412:22: note: in expansion of macro 'SPI_W13_REG'
  412 |       WRITE_PERI_REG(SPI_W13_REG(SPI_PORT), *data++);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1925:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1925 | #define SPI_W14_REG (DR_REG_SPI_BASE + 0xd0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:413:7: note: in expansion of macro 'WRITE_PERI_REG'
  413 |       WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:413:22: note: in expansion of macro 'SPI_W14_REG'
  413 |       WRITE_PERI_REG(SPI_W14_REG(SPI_PORT), *data++);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1937:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1937 | #define SPI_W15_REG (DR_REG_SPI_BASE + 0xd4)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:414:7: note: in expansion of macro 'WRITE_PERI_REG'
  414 |       WRITE_PERI_REG(SPI_W15_REG(SPI_PORT), *data++);
      |       ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:414:22: note: in expansion of macro 'SPI_W15_REG'
  414 |       WRITE_PERI_REG(SPI_W15_REG(SPI_PORT), *data++);
      |                      ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:13: note: in expansion of macro 'WRITE_PERI_REG'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |             ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:416:7: note: in expansion of macro 'SET_PERI_REG_MASK'
  416 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |       ^~~~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:416:25: note: in expansion of macro 'SPI_CMD_REG'
  416 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |                         ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:54: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator|'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |                                                      ^~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:100:76: note: in definition of macro 'WRITE_PERI_REG'
  100 |             (*((volatile uint32_t *)ETS_UNCACHED_ADDR(addr))) = (uint32_t)(val);                                       \
      |                                                                            ^~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:416:7: note: in expansion of macro 'SET_PERI_REG_MASK'
  416 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |       ^~~~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:417:14: note: in expansion of macro 'READ_PERI_REG'
  417 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_UPDATE);
      |              ^~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:417:28: note: in expansion of macro 'SPI_CMD_REG'
  417 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_UPDATE);
      |                            ^~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:417:50: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator&'
  417 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_UPDATE);
      |                                                  ^
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:13: note: in expansion of macro 'WRITE_PERI_REG'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |             ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:419:7: note: in expansion of macro 'SET_PERI_REG_MASK'
  419 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      |       ^~~~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:419:25: note: in expansion of macro 'SPI_CMD_REG'
  419 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      |                         ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:54: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator|'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |                                                      ^~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:100:76: note: in definition of macro 'WRITE_PERI_REG'
  100 |             (*((volatile uint32_t *)ETS_UNCACHED_ADDR(addr))) = (uint32_t)(val);                                       \
      |                                                                            ^~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:419:7: note: in expansion of macro 'SET_PERI_REG_MASK'
  419 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      |       ^~~~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:426:12: note: in expansion of macro 'READ_PERI_REG'
  426 |     while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |            ^~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:426:26: note: in expansion of macro 'SPI_CMD_REG'
  426 |     while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                          ^~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:426:48: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator&'
  426 |     while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                                                ^
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:481:26: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
  481 | #define SPI_MS_DLEN_REG (DR_REG_SPI_BASE + 0x1c)
      |                          ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:427:5: note: in expansion of macro 'WRITE_PERI_REG'
  427 |     WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), (len << 4) - 1);
      |     ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.h:61:34: note: in expansion of macro 'SPI_MS_DLEN_REG'
   61 |     #define SPI_MOSI_DLEN_REG(x) SPI_MS_DLEN_REG(x)
      |                                  ^~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:427:20: note: in expansion of macro 'SPI_MOSI_DLEN_REG'
  427 |     WRITE_PERI_REG(SPI_MOSI_DLEN_REG(SPI_PORT), (len << 4) - 1);
      |                    ^~~~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:1757:21: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
 1757 | #define SPI_W0_REG (DR_REG_SPI_BASE + 0x98)
      |                     ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:428:45: note: in expansion of macro 'WRITE_PERI_REG'
  428 |     for (uint32_t i=0; i <= (len<<1); i+=4) WRITE_PERI_REG((SPI_W0_REG(SPI_PORT) + i), *data++);
      |                                             ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:428:61: note: in expansion of macro 'SPI_W0_REG'
  428 |     for (uint32_t i=0; i <= (len<<1); i+=4) WRITE_PERI_REG((SPI_W0_REG(SPI_PORT) + i), *data++);
      |                                                             ^~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:13: note: in expansion of macro 'WRITE_PERI_REG'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |             ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:430:7: note: in expansion of macro 'SET_PERI_REG_MASK'
  430 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |       ^~~~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:430:25: note: in expansion of macro 'SPI_CMD_REG'
  430 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |                         ^~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:54: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator|'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |                                                      ^~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:100:76: note: in definition of macro 'WRITE_PERI_REG'
  100 |             (*((volatile uint32_t *)ETS_UNCACHED_ADDR(addr))) = (uint32_t)(val);                                       \
      |                                                                            ^~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:430:7: note: in expansion of macro 'SET_PERI_REG_MASK'
  430 |       SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_UPDATE);
      |       ^~~~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:431:14: note: in expansion of macro 'READ_PERI_REG'
  431 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_UPDATE);
      |              ^~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:431:28: note: in expansion of macro 'SPI_CMD_REG'
  431 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_UPDATE);
      |                            ^~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:431:50: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator&'
  431 |       while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_UPDATE);
      |                                                  ^
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:13: note: in expansion of macro 'WRITE_PERI_REG'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |             ^~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:433:5: note: in expansion of macro 'SET_PERI_REG_MASK'
  433 |     SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      |     ^~~~~~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:433:23: note: in expansion of macro 'SPI_CMD_REG'
  433 |     SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      |                       ^~~~~~~~~~~
