mboehmerm/Three-IPS-Displays-with-ST7789-170x320-240x280-240x320/ESP32_H2/Arduino/ESP32_H2_TFT_graphicstest_240x280/ESP32_H2_TFT_graphicstest_240x280.ino
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:110:54: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator|'
  110 |             WRITE_PERI_REG((reg), (READ_PERI_REG(reg)|(mask)));                                                        \
      |                                                      ^~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:100:76: note: in definition of macro 'WRITE_PERI_REG'
  100 |             (*((volatile uint32_t *)ETS_UNCACHED_ADDR(addr))) = (uint32_t)(val);                                       \
      |                                                                            ^~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:433:5: note: in expansion of macro 'SET_PERI_REG_MASK'
  433 |     SET_PERI_REG_MASK(SPI_CMD_REG(SPI_PORT), SPI_USR);
      |     ^~~~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/spi_reg.h:17:22: error: 'DR_REG_SPI_BASE' was not declared in this scope; did you mean 'DR_REG_SPI0_BASE'?
   17 | #define SPI_CMD_REG (DR_REG_SPI_BASE + 0x0)
      |                      ^~~~~~~~~~~~~~~
C:\Users\mb\AppData\Local\Arduino15\packages\esp32\tools\esp32-arduino-libs\idf-release_v5.1-dc859c1e67\esp32h2/include/soc/esp32h2/include/soc/soc.h:30:34: note: in definition of macro 'ETS_UNCACHED_ADDR'
   30 | #define ETS_UNCACHED_ADDR(addr) (addr)
      |                                  ^~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:435:10: note: in expansion of macro 'READ_PERI_REG'
  435 |   while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |          ^~~~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:435:24: note: in expansion of macro 'SPI_CMD_REG'
  435 |   while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                        ^~~~~~~~~~~
c:\Users\mb\Documents\Arduino\libraries\TFT_eSPI\Processors/TFT_eSPI_ESP32_C3.c:435:46: error: invalid operands of types 'void' and 'long unsigned int' to binary 'operator&'
  435 |   while (READ_PERI_REG(SPI_CMD_REG(SPI_PORT))&SPI_USR);
      |                                              ^

exit status 1

Compilation error: exit status 1
*/


/***************************************************
  Original sketch text:

  This is an example sketch for the Adafruit 2.2" SPI display.
  This library works with the Adafruit 2.2" TFT Breakout w/SD card
  ----> http://www.adafruit.com/products/1480
 
  Check out the links above for our tutorials and wiring diagrams
  These displays use SPI to communicate, 4 or 5 pins are required to
  interface (RST is optional)
  Adafruit invests time and resources providing this open source code,
  please support Adafruit and open-source hardware by purchasing
  products from Adafruit!

  Written by Limor Fried/Ladyada for Adafruit Industries.
  MIT license, all text above must be included in any redistribution
 ****************************************************/
 
